<template>
  <el-container>
    <el-main>
      <div class="content">
        <p>免责声明</p>
        <p>本系统旨在为用户节约终端设备成本，便于管理，提高用户工作效率。严禁使用本系统实施违反国家法律规定和违背公序良俗的行为，包括但不限于以下情形：</p>
        <p>1.危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的、损害国家荣誉和利益的、煽动民族仇恨、民族歧视，破坏民族团结的等政治行为；</p>
        <p>2.包括但不限于淫秽、色情、赌博、诈骗等犯罪行为；</p>
        <p>3.在全球所有网络渠道发布未授权的品牌词和黄、赌、毒、游戏、金融以及有关政治的相关词语，包括但不限于以上情况的黑灰行业，如有发现账户永久停封；</p>
        <p>4.黑灰产领域相关的犯罪行为；</p>
        <p>5.违反法律法规底线、社会主义制度底线、国家利益底线、公民合法权益底线、社会公共秩序底线、道德风尚底线和信息真实性底线的七条底线要求的行为；</p>
        <p>6.其他法律法规禁止的行为。</p>
        <p>如您在使用本系统过程中需要进行国际联网的，需严格遵守《中华人民共和国计算机信息网络国际联网管理暂行规定》的有关规定。严禁使用第三方软件、插件、外挂、系统、设备、脚本等对本系统进行干扰、破坏、修改或施加其他影响，第三方渠道的：国际联网VPN、全球互联网平台账号、收付款平台、自建站、货源、物流、全球平台自动化脚本等第三方渠道的资源，和系统方无任何关联，相关服务和责任由对应第三方承担，且我会合法使用。
          违反上述约定，我方有权进行独立判断并采取相应措施，包括但不限于通过技术手段暂停或终止向您提供服务，限制、中止、冻结或终止您的相关账户，追究法律责任等措施。违反中华人民共和国法律法规，相关国家机关或机构对您提起诉讼、罚款或采取其他制裁措施的，您应自行承担全部责任，我方不承担任何责任，必要时，我方也严格依照法律法规为相关国家机关或机构提供协助。
          除此之外，使用本系统实施违反当地法律法规或道德风俗行为的，您应当为此独立承担责任，我方不承担任何责任。</p>
      </div>
    </el-main>
  </el-container>
</template>

<style>
.content {
  max-width: 800px;
  margin: 0 50px;
  padding: 20px;
  text-align: justify;
  line-height: 1.5;
}
</style>

<script>
import { getToken } from '@/utils/auth'

export default {
  data() {
    return {
    }
  },
  created() {
    // 用户没有登录，则跳转到登录页面
    this.gotoLogin()
  },
  methods: {
    gotoLogin() {
      if (!getToken()) {
        this.$router.push({ path: '/login' })
      }
    }
  }
}
</script>
